src/cf/src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.КоличествоНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>DefinedType.КоличествоНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияОприходование</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаРозничная</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПриходныйДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧГотоваяПродукция</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикат</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ВыпускПродукции/Forms/ФормаДокумента/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);   
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	НесколькоСтрокГП = Объект.ТЧГотоваяПродукция.Количество() > 1;
	НастроитьРежимГотовойПродукции();
	РаботаСДокументами.ОграничитьВидимостьРеквизитовПоТипу(ЭтотОбъект, "ОператорПроизводства");
	НастроитьАвтовыпуск();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТЧСерииПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
	// В многострочном режиме правится ТЧГотоваяПродукция - шапка обновляется из первой
	// строки до синхронизации в модуле объекта, чтобы та не перезаписала таблицу.
	Если НесколькоСтрокГП И ТекущийОбъект.ТЧГотоваяПродукция.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ТекущийОбъект, ТекущийОбъект.ТЧГотоваяПродукция[0],
			"Номенклатура, Характеристика, Серия, Упаковка, КоличествоУпаковок, Количество");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПоказатьСебестоимость();
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПоказатьСебестоимость();
КонецПроцедуры

#КонецОбласти



#Область Дополнительные_процедуры_и_функции

&НаКлиенте
Процедура РассчитатьКоличество()
	Структура = Новый Структура("КоличествоУпаковок, Количество, Упаковка", Объект.КоличествоУпаковок, Объект.Количество, Объект.Упаковка);
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Структура);
	Объект.Количество = Структура.Количество;	
КонецПроцедуры	

&НаСервере
Процедура ПоказатьСебестоимость()
	ТЗСебестоимость = РегистрыНакопления.ТоварыВНаличии.ПолучитьСебестоимостьПоДокументу(Объект.Ссылка);
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		Если Стр.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда Продолжить; КонецЕсли;
		Мас = ТЗСебестоимость.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Серия, ВидДвижения", Стр.Номенклатура, Стр.Характеристика, Стр.Серия, ВидДвиженияНакопления.Расход));
		Если Мас.Количество() = 0 Тогда
			Стр.Себестоимость = 0;	
		Иначе
			Стр.Себестоимость = ?(Мас[0].Количество = Стр.Количество, Мас[0].Сумма, Мас[0].Сумма / Мас[0].Количество * Стр.Количество);	
		КонецЕсли;	
	КонецЦикла;
	ОбщаяСебестоимость = ТЗСебестоимость.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	Объект.Упаковка = ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Номенклатура, "Единица");
    ЗаполнитьТехкарту();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТехкартуНаСервере()
	Документы.ВыпускПродукции.ЗаполнитьМатериалыПоТехкартам(Объект, НесколькоСтрокГП);
КонецПроцедуры

// Автовыпуск при отгрузке (E9) меняет только проведение реализации: форма только для просмотра с надписью-ссылкой на
// реализацию. У ручного выпуска основанием выбирается только заказ: реализация-основание сделала бы его автовыпуском.
//
&НаСервере
Процедура НастроитьАвтовыпуск()
	ЭтоАвтовыпуск = Производство.ЭтоАвтовыпуск(Объект);
	Элементы.НадписьАвтовыпуск.Видимость = ЭтоАвтовыпуск;
	Если ЭтоАвтовыпуск Тогда
		ТолькоПросмотр = Истина;
		Элементы.НадписьАвтовыпуск.Заголовок = СтрШаблон(НСтр("ru = 'Создан автоматически при проведении реализации %1';
			|fr = 'Créée automatiquement lors de la validation de la vente %1';
			|en = 'Created automatically when sale %1 was posted';
			|es = 'Creada automáticamente al contabilizar la venta %1'"), Объект.Основание);
	Иначе
		Элементы.Основание.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НадписьАвтовыпускНажатие(Элемент)
	ПоказатьЗначение(, Объект.Основание);
КонецПроцедуры

&НаСервере
Процедура НастроитьРежимГотовойПродукции()
	// Одиночный режим - продукция в шапке; многострочный - таблица ТЧГотоваяПродукция.
	Элементы.ГруппаГотоваяПродукция.Видимость = НесколькоСтрокГП;
	Элементы.Номенклатура.Видимость = Не НесколькоСтрокГП;
	Элементы.Характеристика.Видимость = Не НесколькоСтрокГП;
	Элементы.ГруппаКоличествоЕдиница.Видимость = Не НесколькоСтрокГП;
	Элементы.Серия.Видимость = Не НесколькоСтрокГП;
	Элементы.ГруппаСерии.Видимость = Не НесколькоСтрокГП;
	// Розничная цена пишется только для единственной позиции выпуска.
	Элементы.ЦенаРозничная.Видимость = Не НесколькоСтрокГП;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТехкарту(Команда = Неопределено)
	ЗаполнитьТехкартуНаСервере();
КонецПроцедуры

#КонецОбласти      




#Область Обработчики_элементов_формы 

 &НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоУпаковокПриИзменении(Элемент)
	РассчитатьКоличество();	
КонецПроцедуры

&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	РассчитатьКоличество();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьКоличество(Элементы.ТЧТовары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПартияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеОтбора = Новый Структура("МестоХранения, Номенклатура, Характеристика",
		Объект.МестоХранения, ТекСтр.Номенклатура, ТекСтр.Характеристика);
	ПартииИРазмещениеКлиент.ВыбратьПартиюПоОстаткам(РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект),
		ДанныеОтбора, , ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура ТЧСерииСерияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ТЧСерии.ТекущиеДанные;
	ДанныеОтбора = Новый Структура("МестоХранения, Номенклатура, Характеристика", Объект.МестоХранения, Объект.Номенклатура, Объект.Характеристика);
	СерииИРазмещениеКлиент.ВыбратьСериюПоОстаткам(РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Объект), ДанныеОтбора,, ТекСтр);
КонецПроцедуры

&НаКлиенте
Процедура ТЧСерииКоличествоУпаковокПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧСерии.ТекущиеДанные;
	Структура = Новый Структура("КоличествоУпаковок, Количество, Упаковка", ТекСтр.КоличествоУпаковок, ТекСтр.Количество, Объект.Упаковка);
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Структура);
	ТекСтр.Количество = Структура.Количество;	
КонецПроцедуры

&НаКлиенте
Процедура ТЧСерииПриИзменении(Элемент)
	СерииВТЧ = Не Объект.ТЧСерии.Количество() = 0;
	Элементы.КоличествоУпаковок.Доступность = Не СерииВТЧ;
	Если СерииВТЧ Тогда 
		Объект.КоличествоУпаковок = Объект.ТЧСерии.Итог("КоличествоУпаковок");
		Объект.Количество = Объект.ТЧСерии.Итог("Количество");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НесколькоСтрокГППриИзменении(Элемент)
	Если Не НесколькоСтрокГП И Объект.ТЧГотоваяПродукция.Количество() > 1 Тогда
		НесколькоСтрокГП = Истина;
		ПоказатьПредупреждение(, НСтр("ru = 'В таблице несколько позиций продукции - сначала удалите лишние строки.';
			|fr = 'Le tableau contient plusieurs produits - supprimez d''abord les lignes superflues.';
			|en = 'The table contains multiple products - remove the extra rows first.';
			|es = 'La tabla contiene varios productos: elimine primero las filas sobrantes.'"));
		Возврат;
	КонецЕсли;
	Если НесколькоСтрокГП И Объект.ТЧГотоваяПродукция.Количество() = 0 И ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		НС = Объект.ТЧГотоваяПродукция.Добавить();
		НС.КодСтроки = 1;
		ЗаполнитьЗначенияСвойств(НС, Объект, "Номенклатура, Характеристика, Серия, Упаковка, КоличествоУпаковок, Количество");
	КонецЕсли;
	Если Не НесколькоСтрокГП И Объект.ТЧГотоваяПродукция.Количество() = 1 Тогда
		ЗаполнитьЗначенияСвойств(Объект, Объект.ТЧГотоваяПродукция[0],
			"Номенклатура, Характеристика, Серия, Упаковка, КоличествоУпаковок, Количество");
	КонецЕсли;
	НастроитьРежимГотовойПродукции();
КонецПроцедуры

&НаКлиенте
Процедура ТЧГотоваяПродукцияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧГотоваяПродукция);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧГотоваяПродукцияНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧГотоваяПродукция.ТекущиеДанные, Объект, Ложь);
	ЗаполнитьТехкарту();
КонецПроцедуры

&НаКлиенте
Процедура ТЧГотоваяПродукцияНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыПолученияДанных.Вставить("ВыводитьСерию", Истина);
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧГотоваяПродукцияНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧГотоваяПродукция.ТекущиеДанные, ВыбранноеЗначение,
		Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧГотоваяПродукцияУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧГотоваяПродукция.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТЧГотоваяПродукцияКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьКоличество(Элементы.ТЧГотоваяПродукция.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти // Обработчики_элементов_формы
